src/performance/j-meter_Eshop (1)/j-meter_Eshop/Result/statistics.json
{
  "Checkout-1" : {
    "transaction" : "Checkout-1",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 940.5399999999998,
    "medianResTime" : 840.0,
    "minResTime" : 311.0,
    "maxResTime" : 2560.0,
    "pct1ResTime" : 1716.4000000000003,
    "pct2ResTime" : 1862.599999999999,
    "pct3ResTime" : 2554.069999999997,
    "throughput" : 7.222824124232575,
    "receivedKBytesPerSec" : 47.18817713976164,
    "sentKBytesPerSec" : 6.658540989526904
  },
  "Ordering-0" : {
    "transaction" : "Ordering-0",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 858.09,
    "medianResTime" : 668.5,
    "minResTime" : 291.0,
    "maxResTime" : 2087.0,
    "pct1ResTime" : 1707.9,
    "pct2ResTime" : 1868.5499999999995,
    "pct3ResTime" : 2086.91,
    "throughput" : 7.971303308090873,
    "receivedKBytesPerSec" : 1.4245590872857712,
    "sentKBytesPerSec" : 6.671295834994021
  },
  "Entering Login Details" : {
    "transaction" : "Entering Login Details",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 320.09000000000003,
    "medianResTime" : 300.5,
    "minResTime" : 271.0,
    "maxResTime" : 544.0,
    "pct1ResTime" : 384.30000000000007,
    "pct2ResTime" : 505.6999999999995,
    "pct3ResTime" : 543.91,
    "throughput" : 10.309278350515465,
    "receivedKBytesPerSec" : 65.86007973582474,
    "sentKBytesPerSec" : 11.732039304123711
  },
  "Checkout-0" : {
    "transaction" : "Checkout-0",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 877.2499999999999,
    "medianResTime" : 746.0,
    "minResTime" : 324.0,
    "maxResTime" : 2219.0,
    "pct1ResTime" : 1814.8000000000004,
    "pct2ResTime" : 1908.0,
    "pct3ResTime" : 2217.3899999999994,
    "throughput" : 7.186489399928135,
    "receivedKBytesPerSec" : 1.2843042579949695,
    "sentKBytesPerSec" : 8.393595041322314
  },
  "Ordering-1" : {
    "transaction" : "Ordering-1",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 896.23,
    "medianResTime" : 837.5,
    "minResTime" : 285.0,
    "maxResTime" : 2286.0,
    "pct1ResTime" : 1726.5000000000005,
    "pct2ResTime" : 1853.0499999999995,
    "pct3ResTime" : 2283.2499999999986,
    "throughput" : 7.217610970768676,
    "receivedKBytesPerSec" : 47.1541185492602,
    "sentKBytesPerSec" : 6.30836115120895
  },
  "Login" : {
    "transaction" : "Login",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 296.24,
    "medianResTime" : 290.0,
    "minResTime" : 272.0,
    "maxResTime" : 405.0,
    "pct1ResTime" : 315.9,
    "pct2ResTime" : 362.5999999999999,
    "pct3ResTime" : 404.7499999999999,
    "throughput" : 10.51745898190997,
    "receivedKBytesPerSec" : 68.53808963504417,
    "sentKBytesPerSec" : 8.422183950357594
  },
  "Logout-1" : {
    "transaction" : "Logout-1",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 721.6500000000003,
    "medianResTime" : 434.0,
    "minResTime" : 276.0,
    "maxResTime" : 1859.0,
    "pct1ResTime" : 1624.7,
    "pct2ResTime" : 1728.1999999999998,
    "pct3ResTime" : 1858.5599999999997,
    "throughput" : 7.80579189758801,
    "receivedKBytesPerSec" : 51.07305245492155,
    "sentKBytesPerSec" : 7.27219284208883
  },
  "Logout-0" : {
    "transaction" : "Logout-0",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 839.5100000000003,
    "medianResTime" : 543.0,
    "minResTime" : 280.0,
    "maxResTime" : 2127.0,
    "pct1ResTime" : 1853.5000000000005,
    "pct2ResTime" : 2005.6,
    "pct3ResTime" : 2126.73,
    "throughput" : 7.726781023025807,
    "receivedKBytesPerSec" : 1.4563171264101376,
    "sentKBytesPerSec" : 8.43607537474888
  },
  "HomePage" : {
    "transaction" : "HomePage",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 812.86,
    "medianResTime" : 803.0,
    "minResTime" : 765.0,
    "maxResTime" : 947.0,
    "pct1ResTime" : 856.9,
    "pct2ResTime" : 902.4499999999998,
    "pct3ResTime" : 947.0,
    "throughput" : 9.847365829640571,
    "receivedKBytesPerSec" : 132.19896294928608,
    "sentKBytesPerSec" : 5.673775233874939
  },
  "Checkout" : {
    "transaction" : "Checkout",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1818.2199999999998,
    "medianResTime" : 1585.0,
    "minResTime" : 705.0,
    "maxResTime" : 3776.0,
    "pct1ResTime" : 3006.2000000000003,
    "pct2ResTime" : 3284.2499999999995,
    "pct3ResTime" : 3775.1199999999994,
    "throughput" : 6.975446428571429,
    "receivedKBytesPerSec" : 46.81859697614397,
    "sentKBytesPerSec" : 14.577593122209821
  },
  "Test" : {
    "transaction" : "Test",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 8802.829999999998,
    "medianResTime" : 8957.5,
    "minResTime" : 5928.0,
    "maxResTime" : 10712.0,
    "pct1ResTime" : 9821.8,
    "pct2ResTime" : 10024.9,
    "pct3ResTime" : 10707.229999999998,
    "throughput" : 5.357334190506804,
    "receivedKBytesPerSec" : 322.14503266299687,
    "sentKBytesPerSec" : 59.61248057966356
  },
  "success" : {
    "transaction" : "success",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1002.6000000000005,
    "medianResTime" : 973.5,
    "minResTime" : 292.0,
    "maxResTime" : 2463.0,
    "pct1ResTime" : 1877.2000000000005,
    "pct2ResTime" : 1998.9999999999998,
    "pct3ResTime" : 2462.3399999999997,
    "throughput" : 7.342143906020558,
    "receivedKBytesPerSec" : 49.2583287444934,
    "sentKBytesPerSec" : 5.872281112334802
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 1600,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 948.2393749999997,
    "medianResTime" : 753.5,
    "minResTime" : 271.0,
    "maxResTime" : 3833.0,
    "pct1ResTime" : 1966.9,
    "pct2ResTime" : 2574.6499999999987,
    "pct3ResTime" : 3419.8100000000004,
    "throughput" : 42.813946643118996,
    "receivedKBytesPerSec" : 233.4012074452784,
    "sentKBytesPerSec" : 50.680382181370575
  },
  "Logout" : {
    "transaction" : "Logout",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1561.5399999999993,
    "medianResTime" : 1001.5,
    "minResTime" : 556.0,
    "maxResTime" : 3721.0,
    "pct1ResTime" : 3022.0,
    "pct2ResTime" : 3412.5999999999985,
    "pct3ResTime" : 3719.7699999999995,
    "throughput" : 7.547169811320755,
    "receivedKBytesPerSec" : 50.8033608490566,
    "sentKBytesPerSec" : 15.27122641509434
  },
  "Ordering" : {
    "transaction" : "Ordering",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1754.8,
    "medianResTime" : 1586.0,
    "minResTime" : 577.0,
    "maxResTime" : 3833.0,
    "pct1ResTime" : 3250.3,
    "pct2ResTime" : 3604.65,
    "pct3ResTime" : 3831.049999999999,
    "throughput" : 7.019514249613927,
    "receivedKBytesPerSec" : 47.114376403902845,
    "sentKBytesPerSec" : 12.009950161448828
  },
  "Adding Item to Basket" : {
    "transaction" : "Adding Item to Basket",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1236.4800000000002,
    "medianResTime" : 837.5,
    "minResTime" : 604.0,
    "maxResTime" : 3326.0,
    "pct1ResTime" : 2594.3,
    "pct2ResTime" : 2823.199999999999,
    "pct3ResTime" : 3325.3999999999996,
    "throughput" : 8.813678829543452,
    "receivedKBytesPerSec" : 61.14489687995769,
    "sentKBytesPerSec" : 17.52407236030319
  },
  "Adding Item to Basket-0" : {
    "transaction" : "Adding Item to Basket-0",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 593.2800000000001,
    "medianResTime" : 400.0,
    "minResTime" : 304.0,
    "maxResTime" : 2214.0,
    "pct1ResTime" : 1218.9000000000005,
    "pct2ResTime" : 1618.1499999999999,
    "pct3ResTime" : 2211.1299999999983,
    "throughput" : 9.714396735962698,
    "receivedKBytesPerSec" : 2.2198914416164754,
    "sentKBytesPerSec" : 10.805369025646007
  },
  "Adding Item to Basket-1" : {
    "transaction" : "Adding Item to Basket-1",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 642.45,
    "medianResTime" : 398.0,
    "minResTime" : 290.0,
    "maxResTime" : 2598.0,
    "pct1ResTime" : 1252.0000000000002,
    "pct2ResTime" : 1657.7999999999995,
    "pct3ResTime" : 2597.5199999999995,
    "throughput" : 9.064539521392312,
    "receivedKBytesPerSec" : 60.813854015591005,
    "sentKBytesPerSec" : 7.940324170594634
  }
}